---
kind: type
id: T:Autodesk.Revit.DB.DigitGroupingAmount
source: html/0141b154-5863-50a9-050c-ad90c6247da1.htm
---
# Autodesk.Revit.DB.DigitGroupingAmount

The number of digits in each group when numbers are formatted with digit grouping.

## Syntax (C#)
```csharp
public enum DigitGroupingAmount
```